app/controllers/alarms_controller.rb

	def create
    @alarm = Alarm.new(params[:alarm])
    if @alarm.save
---
INSERT INTO "alarms" ("created_at", "lead_time", "phone", "updated_at", "when") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 06 Dec 2011 04:51:10 UTC +00:00], ["lead_time", nil], ["phone", 4152729330], ["updated_at", Tue, 06 Dec 2011 04:51:10 UTC +00:00], ["when", nil]]

  def show
    @alarm = Alarm.find(params[:id])
---
SELECT "alarms".* FROM "alarms" WHERE "alarms"."id" = ? LIMIT 1  [["id", "1"]]